# ParameterDownloadOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterDownloadOptions Constructor
ParameterDownloadOptions Class See Also
---
Default constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ParameterDownloadOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ParameterDownloadOptions()
```

# See Also
ParameterDownloadOptions Class
ParameterDownloadOptions Overload
Autodesk.Revit.DB Namespace